export default {
  data () {
    return {
      filter: {}
    }
  },
  methods: {
    /**
     * ===========================================================
     * 搜索
     * ===========================================================
     */
    search (data) {
      Object.assign(this.filter, data)
      this.getList(1, true, '查询成功')
    },
    /**
     * ===========================================================
     * 重置搜索
     * ===========================================================
     */
    resetSearch () {
      this.$set(this, 'filter', {})
      this.getList(1)
    }
  }
}
